---
kind: type
id: T:Autodesk.Revit.DB.DGNImportOptions
source: html/81dec13f-8eca-f2eb-bf60-1e206e6d0d98.htm
---
# Autodesk.Revit.DB.DGNImportOptions

The import options used to import DGN format files.

## Syntax (C#)
```csharp
public class DGNImportOptions : BaseImportOptions
```